---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToRestoreAllMembersOfGroups
source: html/ba42b43e-51a7-7103-8856-f500d1048398.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToRestoreAllMembersOfGroups Property

Revit is unable to restore the members of the selected groups.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToRestoreAllMembersOfGroups { get; }
```